app/Controllers/Home.php

SELECT *
FROM `tbl_pegawai`
WHERE `tbl_pegawai`.`deleted_at` IS NULL
---
    public function add_kegiatan()
    {
        $data['pegawai'] = $this->pegawai->findAll();

INSERT INTO `tbl_kegiatan` (`kegiatan`, `verified_by`, `created_at`, `updated_at`) VALUES ('Tadarus Bersama', '2', '2022-07-30 16:42:03', '2022-07-30 16:42:03')
---
    public function add_proses()
    {
        if (!$this->validate([
            'kegiatan'  => [
                'rules' => 'required',
                'errors' => [
                    'required'  => '{field} Harus diisi'
                ]
            ]
        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }
        $this->kegiatan->insert([
            'kegiatan' => $this->request->getVar('kegiatan'),
            'verified_by' => $this->request->getVar('verifikasi'),
        ]);