app/Models/KegiatanModel.php

SELECT `A`.`id`, `A`.`kegiatan`, `A`.`verified_by`, `B`.`fullname`
FROM `tbl_kegiatan` `A`
LEFT JOIN `tbl_pegawai` `B` ON `B`.`id` = `A`.`verified_by`
---
    function getAll()
    {
        $builder = $this->db->table('tbl_kegiatan A');
        $builder->select('A.id,
                        A.kegiatan,
                        A.verified_by,
                        B.fullname');
        $builder->join('tbl_pegawai B', 'B.id = A.verified_by', 'left');
        $query = $builder->get();